{
  "skill_id": "skill-update.NeonGeckoCom",
  "source": "https://github.com/NeonGeckoCom/skill-update",
  "license": "NOASSERTION",
  "name": "Neon Updates",
  "description": "The update skill provides intents for the user to manage device updates, including\ncore packages, skills, configuration, and creation of new boot media.\n\n### Software Updates\nThis skill can be used to check for software updates and to start the update\nprocess on supported devices. For most devices, updates will take 10-30 minutes,\nand you will not be able to use your device while it is updating.\n\n### Configuration Updates\nFor supported distributions, this skill allows getting updated default configuration.\nThis can be useful for resetting skills configuration to the latest default, or for\ntroubleshooting after making manual configuration changes.\n\n### Create New Media\nFor supported distributions, this skill is able to create a new boot drive from\na clean image, similar to what would be distributed with a new device. This involves\ndownloading a new image and then writing it to an available storage device. This\nis a multi-step process.\n1. An operating system image is downloaded. Depending on internet connection\nspeeds, this generally takes about 15-20 minutes.\n2. After user confirmation, this image is written to a non-boot drive connected\nto the device. **All existing on the new boot drive is lost**. This generally\ntakes about 30-45 minutes.\n3. After this is complete, the device is shut down so the user may unplug the old\ndrive and boot the new one.",
  "examples": [
    "Check for updates.",
    "Do you have any updates?",
    "Update my default configuration.",
    "Create a new boot drive.",
    "Switch to beta releases.",
    "Change to stable updates."
  ],
  "tags": [
    "Information",
    "NeonGecko",
    "Original",
    "NeonAI",
    "Update"
  ],
  "icon": "https://raw.githubusercontent.com/NeonGeckoCom/skill-update/dev/./logo.svg",
  "author": "NeonGeckoCom"
}